Courses/4420/Lectures/Fortification/Audit/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Security Audit</title>
<!-- 2018-09-25 Tue 21:09 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Prabhaker Mateti" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../"> UP </a>
 |
 <a accesskey="H" href="../../../Top/index.html"> HOME </a>
</div><div id="preamble" class="status">
<a href="../../"> ../../</a> | <a href=./>NoSlides</a>
</div>
<div id="content">
<h1 class="title">Security Audit</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Overview</a></li>
<li><a href="#sec-2">2. Site Security Handbook</a></li>
<li><a href="#sec-3">3. Lab Experiment</a></li>
<li><a href="#sec-4">4. Acknowledgements</a></li>
<li><a href="#sec-5">5. References</a></li>
<li><a href="#sec-6">6. End</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Overview</h2>
<div class="outline-text-2" id="text-1">
<p>
Abstract: Auditing the security of an individual host and LAN is a
necessary activity.  This lecture describes the components of a
security policy and how to set up a platform for conducting this
audit, and the typical structure of a final report.
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Site Security Handbook</h2>
<div class="outline-text-2" id="text-2">
<ol class="org-ol">
<li><a href="https://tools.ietf.org/pdf/rfc2196">https://tools.ietf.org/pdf/rfc2196</a> 24pp, 1997; 
</li>
<li>Table of Contents
</li>
</ol>

<div class="org-src-container">

<pre class="src src-bash">1.   Introduction....................................................  2
1.1  Purpose of this Work............................................  3
1.2  Audience........................................................  3
1.3  Definitions.....................................................  3
1.4  Related Work....................................................  4
1.5  Basic Approach..................................................  4
1.6  Risk Assessment.................................................  5
2.   Security Policies...............................................  6
2.1  What is a Security Policy and Why Have One?.....................  6
2.2  What Makes a Good Security Policy?..............................  9
2.3  Keeping the Policy Flexible..................................... 11
3.   Architecture.................................................... 11
3.1  Objectives...................................................... 11
3.2  Network and Service Configuration............................... 14
3.3  Firewalls....................................................... 20
4.   Security Services and Procedures................................ 24
4.1  Authentication.................................................. 24
4.2  Confidentiality................................................. 28
4.3  Integrity....................................................... 28
</pre>
</div>
</div>
</div>


<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Lab Experiment</h2>
<div class="outline-text-2" id="text-3">
<ol class="org-ol">
<li><a href="https://dirtycow.ninja/">https://dirtycow.ninja/</a> Dirty COW (CVE-2016-5195) is a privilege
escalation vulnerability in the Linux Kernel
</li>

<li><a href="https://github.com/oleg-fiksel/ansible_CVE-2016-5195_check">https://github.com/oleg-fiksel/ansible_CVE-2016-5195_check</a> Playbook
for testing the Dirty Cow vulnerability (CVE-2016-5195).
</li>

<li><a href="https://github.com/mzet-/linux-exploit-suggester">https://github.com/mzet-/linux-exploit-suggester</a> 2016+ Often a
security analyst needs to identify privilege escalation attack
vectors.  One of viable attack vectors is using publicly known
Linux exploit to gain root privileges.  Of course
in order to do that the analyst needs to identify the right PoC
exploit, make sure that his target is affected by the associated
vulnerability and finally modify the exploit to suit his
target. The <code>linux-exploit-suggester.sh</code> tool is designed to help
with these activities.
</li>

<li>Linux privilege escalation auditing tool
<a href="https://github.com/mzet-/linux-exploit-suggester">https://github.com/mzet-/linux-exploit-suggester</a> 
</li>
<li><a href="https://www.exploit-db.com/">https://www.exploit-db.com/</a>
<a href="https://www.exploit-db.com/platform/?p=Linux">https://www.exploit-db.com/platform/?p=Linux</a> Download Exploit Code
· Download Vulnerable Application &#x2026; Linux 4.18 - Arbitrary Kernel
Read into dmesg via Missing Address Check in segfault.
</li>
<li><a href="https://www.kb.cert.org/vuls/id/584653">https://www.kb.cert.org/vuls/id/584653</a> CPU hardware vulnerable to
side-channel attacks Spectre Meltdown Variant 1 (CVE-2017-5753,
Spectre): Bounds check bypass ; Variant 2 (CVE-2017-5715, also
Spectre): Branch target injection; Variant 3 (CVE-2017-5754,
Meltdown): Rogue data cache load, memory access permission check
performed after kernel memory read
</li>

<li><a href="https://www.cvedetails.com/cve/CVE-2018-1000200/">https://www.cvedetails.com/cve/CVE-2018-1000200/</a> The Linux Kernel
versions 4.14, 4.15, and 4.16 has a null pointer dereference which
can result in an out of memory (OOM) killing of large mlocked
processes. The issue arises from an oom killed process's final
thread calling exit<sub>mmap</sub>(), which calls munlock<sub>vma</sub><sub>pages</sub><sub>all</sub>() for
mlocked vmas.This can happen synchronously with the oom reaper's
unmap<sub>page</sub><sub>range</sub>() since the vma's VM<sub>LOCKED</sub> bit is cleared before
munlocking (to determine if any other vmas share the memory and are
mlocked). Publish Date : 2018-06-05 Last Update Date : 2018-08-29
</li>

<li><a href="https://www.cvedetails.com/vulnerability-list/vendor_id-33/product_id-47/Linux-Linux-Kernel.html">https://www.cvedetails.com/vulnerability-list/vendor_id-33/product_id-47/Linux-Linux-Kernel.html</a>
   Security Vulnerabilities Null ptr deref; Buf Overflow
</li>

<li>A new severe vulnerability (CVE 2018-11776) has been disclosed in
Apache Struts 2 on Aug 22nd.
</li>
</ol>
</div>
</div>


<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Acknowledgements</h2>
</div>


<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> References</h2>
<div class="outline-text-2" id="text-5">
<ol class="org-ol">
<li>Prabhaker Mateti, Security Audit, July 2000, [PowerPoint
slides]. Lance Spitzner, "Auditing Your Firewall Setup,"
March, 2000. <a href="http://www.enteract.com/~lspitz/">http://www.enteract.com/~lspitz/</a> audit.html.  Required
Reading.
</li>

<li>Henderson Group,  "How to Audit Windows NT Security," 10/01/97,
<a href="http://home.us.net/~stu/">http://home.us.net/~stu/</a> ntsec1.html  Recommended Reading.
</li>

<li>Dan Farmer, and Wietse Venema, "Improving the Security of Your Site
by Breaking Into it," [Local copy .html] Required Reading.
</li>

<li>Auditors Checklists and Other Audit Information,
<a href="http://all.net/books/audit/top.html">http://all.net/books/audit/top.html</a> Recommended Reading.
</li>

<li><a href="https://en.wikipedia.org/wiki/Site_Security_Handbook">https://en.wikipedia.org/wiki/Site_Security_Handbook</a>; older
versions: P. Holbrook, J. Reynolds (Editors), "RFC 1244, Site
Security Handbook," <a href="https://www.ietf.org/rfc/rfc1244.txt">https://www.ietf.org/rfc/rfc1244.txt</a> 1991
Reference.
</li>

<li>Simson Garfinkel, Gene Spafford, Chapter 10: Auditing and Logging,
Practical Unix and Internet Security, 3rd edition (2003), O'Reilly
&amp; Associates; ISBN: 0596003234. Required Reading.
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> End</h2>
<div class="outline-text-2" id="text-6">
</div>
</div>
</div>
<div id="postamble" class="status">
<hr size=1>Copyright &copy; 2018 <a href="http://www.wright.edu/~pmateti">www.wright.edu/~pmateti</a> &bull; 2018-09-24
</div>
</body>
</html>
